[
  {
    "query": "I need someone experienced with machine learning for a healthcare project",
    "ground_truth": "Based on your requirement for machine learning expertise in healthcare, two employees stand out. Dr. Sarah Chen has 6 years of experience applying ML in medical projects, including building a Medical Diagnosis Platform that used computer vision for X-ray analysis. She is skilled in TensorFlow, PyTorch, and medical data handling, and she has published multiple research papers in healthcare AI. Michael Rodriguez is another strong candidate with 4 years of ML experience. He developed a Patient Risk Prediction System using ensemble learning and has worked with HIPAA-compliant healthcare data. His skills include scikit-learn, pandas, and handling electronic health records. Both Sarah and Michael bring domain-specific expertise in applying ML to healthcare challenges."
  },
  {
    "query": "Who can help with cloud migration and DevOps automation?",
    "ground_truth": "For cloud migration and DevOps automation, Rohan Verma and Pooja Agarwal are the most suitable employees. Rohan has 6 years of experience with AWS, Docker, Kubernetes, and Terraform. He successfully led a Cloud Migration project and also designed automated CI/CD pipelines to streamline infrastructure deployment. Pooja Agarwal has 5 years of cloud engineering experience and worked on Infrastructure as Code using Terraform and Azure DevOps. She contributed to automating deployment pipelines and improving system scalability. Together, they provide strong expertise in cloud migration and automation best practices."
  },
  {
    "query": "Do we have anyone skilled in frontend development for web applications?",
    "ground_truth": "Yes, Frank Johnson is highly skilled in frontend development. He has 5 years of experience building modern web applications using React, Angular, and JavaScript. Frank also worked on UI/UX design, ensuring responsive layouts and cross-device compatibility. One of his major contributions was leading the frontend for an E-commerce Platform, where he optimized performance and improved user engagement by 25%. His experience makes him well suited for web application projects that demand high-quality interfaces."
  },
  {
    "query": "Find Python developers with 3+ years experience",
    "ground_truth": "I recommend the following candidates who meet the criteria of having 3+ years of experience in Python development:\n\n1. **Aarav Sharma**: With 4 years of experience, Aarav possesses a strong skill set in Python, Django, REST API, and PostgreSQL. His projects, such as E-commerce Backend, API Development, and Database Optimization, demonstrate his expertise in Python-based development. Aarav is currently available, making him an ideal candidate for immediate consideration.\n2. **Vikram Desai**: Vikram has 4 years of experience and a diverse skill set that includes Python, Data Analysis, SQL, and Tableau. His projects, including Sales Dashboard, Customer Analytics, and BI Reports, showcase his ability to apply Python skills to data-driven projects. Vikram is also available, making him a suitable candidate for this requirement.\n\nBoth Aarav and Vikram have the necessary experience and skills in Python development, and their availability makes them suitable for immediate consideration. I do not recommend Rohan Verma, despite his 6 years of experience, as his skill set is more focused on cloud infrastructure and DevOps, rather than Python development. Additionally, Rohan is currently busy, which may impact his availability for new projects.\n\nIn summary, Aarav Sharma and Vikram Desai are the top recommendations for Python developers with 3+ years of experience, given their relevant skills, project experience, and availability."
  }
]
